[{"title":"Initial Communication","cliptext":"Hello <Client First Name>,\n\nThank you for contacting IBM Security Support! My name is {owner} and I will be assisting you with severity <Severity> case ({case-no}) regarding \"{case-subject}\".\n\nWhile we work together to resolve your case, I would like to ensure that your expectations are being met until final resolution. Our goal is to provide you with excellent support. If at any point you are not satisfied, please let us know immediately.\n\n<signature>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Case followup","cliptext":"Hello <Client First Name>,\n\nI wanted to check in and see if you had any updates for us on this issue. For your convenience, I have copied my last update below:\n\n====================\n<contents of last post>\n====================\n\nI shall await your updates until [FOLLOW UP DATE] and then follow up again.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Signature","cliptext":"Thanks for using IBM!\n{owner}\n{team}\n\nIBM Support Webpage\nhttps://www.ibm.com/mysupport/s/?language=en_US","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Status PDFI (Simple)","cliptext":"Problem Description: {case-description}\n\nBusiness Impact:\n\nSteps to Duplicate:\n\nDesired Behavior:\n\nVersion:\n\nAction Taken:\n\nAction Plan:\n\nAction Owner:","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Status PDFI (Kepner-Tregoe)","cliptext":"Problem Description:\n\nWhat is happening:\nWhere is this happening (one/multiple MHs, apphost, console, etc):\nWhen did this start (including timezone):\nHow often does this occur (regular/intermittent):\nWhat change preceded (auto-updates, config change, etc):\nWhat is the extent of this issue (one or more users, one or more rules, etc):\n\nBusiness Impact:\n\nSteps to Duplicate:\n\nDesired Behavior:\n\nVersion:\n\nAction Taken:\n\nAction Plan:\n\nAction Owner:","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Case Resolution PDFI","cliptext":"Solution:\n\nPublic Solution URL:\n\nClient Consent to Close:","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Not using Webex for remote","cliptext":"Hello <client first name>,\n\nI apologize for the inconvenience. However, due to recent security issues with some 3rd party video conferencing tools, the IBM CIO has mandated that IBMers use only the video conferencing tool that has been vetted and expressly permitted for use in IBM. Cisco Webex Meetings is IBM’s solution for video conferencing, and we are expected to use it for all video conferences.\n\nIt is stated in the IBM Support General Guidelines and Limitations page linked from the IBM Support Guide that while other tools may be available, IBM uses only IBM-approved tools for data exchange. Please note that the tools listed in the article, IBM Assist On-site and IBM Smartcloud, have been replaced by Webex.\n\nIf you cannot use Webex, then I cannot assist you by taking over control of the environment; however, I can attempt to assist you by relaying commands/supporting you over the phone or continuing to review your log files outside of a video conference.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"No Logs No Webex","cliptext":"Hello <client first name>,\n\nAccording to the Client responsibilities outlined in the IBM Support General Guidelines and Limitations page linked from the IBM Support Guide, clients are responsible for providing information about their systems and details about the failing components. From a QRadar point of view, the information that support needs to resolve an issue may include get_logs, system logs (IMM), and/or a Webex session with direct access to the QRadar environment. Without these means, support would be unable to conduct an investigation at a reasonable pace and resolution will take much longer than expected. Support will also be unable to give any specific recommendations based on oral reports of error log entries, however, general recommendations may be provided.\n\nIf approvals are needed to procure logs or to secure a Webex session, please do let us know a timeline as to when those can be obtained. QRadar has a script that administrators can run to help sanitize some information from their log files; more details about that tool can be found here.\n\nIf your security policies prohibit uploading log files to your case and do not allow WebEx sessions, you might want to consider engaging IBM Security Expert Labs for an onsite visit or contact your IBM Account Manager to discuss options; this can help speed up resolution.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"RCA - Lack of Relevant Data","cliptext":"Hello <client first name>, \n\nWe understand that determining the root cause of a particular problem is vital to ensuring your business is not continually impacted by the same issue or that the issue does not occur again; however, in some cases, IBM Support cannot determine a root cause with the data we have available. Unfortunately, this incident is one of those cases where we have investigated thoroughly, provided our analysis, but cannot come to a definitive conclusion on what caused the incident for which this case was opened.   \n\nWe apologize for any inconvenience this may have caused.  If the incident were to happen again, please open up a new case or reopen this case and we’ll continue to help to the best of our abilities with the data we have available to us.   \n\nThank you for your time and understanding. \n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Sev1 reduction - POC","cliptext":"Hello <client first name>,\n\nQRadar Support is not able to work a POC as a severity 1 case as we must ensure proper system down/business impacting issues from clients are handled with priority. One of the ways we categorize these is through the severity of the case. We will work diligently to resolve the issues that come to us for POCs; however, we cannot work them 24x7x365 as the Severity 1 definition mandates. At this time, we will reduce the severity of this case to Severity 2 and continue working business as usual. Thank you for your understanding.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Sev1 reduction - Webex next day","cliptext":"Hello <client first name>,\n\nJust a short follow up to advise we will modify case severity to 2 for now ahead of the planned Webex tomorrow. This prevents our WW teams from trying to contact you outside of your local business hours.\n\nIf you require immediate System Down technical support for this case outside of your local business hrs, please modify case severity back to 1 and our online team will engage.\n\nIn case of any questions\\concerns please feel free to reach out to me directly.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Sev1 reduction - Monitoring","cliptext":"Hello <client first name>\n\nJust a short follow up to advise we will modify case severity to 2 for now as we continue to monitor this issue and the effect of the <configuration changes>. Rest assured that this won't affect our response times, rather it prevents our WW teams from trying to contact you outside of your local business hours.\n\nIf you require immediate System Down technical support for this case outside of your local business hrs., please modify case severity back to 1 and\nour online team will engage.\n\nIn case of any questions\\concerns please feel free to reach out to me directly.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Sev1 reduction - Waiting on non-critical XFile","cliptext":"Hello <client first name>,\n\nJust a short follow up to advise we will modify case severity to 2 for now as we continue to work this case. Rest assured that this won't affect our response times and as soon as our Product Engineering team review we will contact you.\n\nIf you require immediate System Down technical support for this case outside of your local business hrs., please modify case severity back to 1 and our online team will engage.\n\nIn case of any questions\\concerns please feel free to reach out to me directly.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Sev1 reduction - obviously false sev1","cliptext":"Hello <client first name>,\n\nThank you for contacting IBM Security Support. We shall have this ticket assigned to an engineer soon.\n\nThe severity of this ticket needs to be modified to 2 for now as we have certain criteria for severity-1 issues for example, a production system is down or a major functionality is not working causing data loss, etc. Severity-1 issues are also worked 24x7 and we expect a technical resource to be available to work during those hours. \n\nYou can find more information about our severity levels and their descriptions, here:\nhttps://www.ibm.com/support/pages/node/739151\n \nRest assured that the severity change won't affect our response times. At a later stage, if you feel your case is not being handled properly, you may escalate it using the various options mentioned here: https://www.ibm.com/support/pages/qradar-support-case-escalations-and-duty-managers\n\n\n<put in technical matters here based on your triaging>\n\n\nWe highly value customer feedback, so if there is anything more that we can do to improve your support experience with this case, please let us know.\n\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Sev1 reduction - no 24x7","cliptext":"Hello <client first name>,\n\nJust a short follow up to advise we will modify case severity to 2 for now. Severity-1 tickets are worked 24x7 so modifying the severity prevents our WW teams from trying to contact you outside of your local business hours.\n\nIf you require immediate System Down technical support for this case outside of your local business hrs, please modify case severity back to 1 and our online team will engage. In case of any questions\\concerns please feel free to reach out to me directly.\n\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Sev1 reduction - scarce response","cliptext":"Hello <client first name>,\n\nJust a short follow up to advise we will modify case severity to 2 for now as we have not heard back from you since <date>. Severity-1 tickets are worked 24x7 so modifying the severity prevents our WW teams from trying to contact you outside of your local business hours.\n\nIf you require immediate System Down technical support for this case outside of your local business hrs, please modify case severity back to 1 and our online team will engage. In case of any questions\\concerns please feel free to reach out to me directly.\n\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"One issue per ticket","cliptext":"Hello <Client First Name>,\n\nIn order to better assist our clients and to adhere to our IBM Support Guidelines of one issue per case, we have opened a new case <new case no> to track <new case subject>. This will help us to better address and track the unrelated issues raised within the original case.\n\nWhile we work together to resolve your case, I would like to ensure that your expectations are being met until final resolution. Our goal is to provide you with excellent support. If at any point you are not satisfied, please let us know immediately.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"General case closure communication","cliptext":"Hello <Client First Name>,\n\nI am contacting you regarding Case {case-no}, which is open for \"{case-subject}\". As per our recent communication, it is my understanding that this issue is now resolved. As such, I will now close this Case.\n\nResolution Summary:\n\n==============\n<<<<< INCLUDE RESOLUTION SUMMARY>>>>>\n==============\n\nYou may receive a survey from IBM asking about the quality of the support that you received. We would appreciate your feedback on how the Case was handled, including comments regarding things we might have done well.\n\nFor additional QRadar resources, please see visit our QRadar 101 site at: https://www.ibm.com/community/qradar/home/support/\n\nPlease refer to the Software Support Handbook for additional information regarding IBM's Support offerings: http://www-304.ibm.com/webapp/set2/sas/f/handbook/home.html\n\nShould you need further assistance or have any additional questions regarding this or other issues, please do not hesitate to contact us.\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Unresponsive client","cliptext":"Hello <Client first name>,\n\nRegarding Case# {case-no}:\n\nAs we have made multiple attempts to contact you regarding your case and did not receive a response, we are closing this case for now. You may reopen the case within 30 days to continue driving towards resolution. If you need further assistance, or have any additional questions, please do not hesitate to contact us.\n\n==============\n<<<<< INCLUDE LAST SET OF INSTRUCTIONS SENT TO CLIENT>>>>>\n==============\n\n<use Signature template here>","type":"TEMPLATE","parentId":"mytemplate"},{"title":"Closure Checklist","cliptext":"Closure PDFI updated (Y/N):\n3 Strikes Done (Y/N):\nConsent to close (Y/N):\nKnown Issues Attached (Y/N):\nKCS Content keyword (Y/N):\nConfirmed Solution (Y/N):\nSurvey (Y/N): \nClosure Code Keyword Added (Y/N):","type":"TEMPLATE","parentId":"mytemplate"}]